<!-- dflook/terraform-github-actions {"workspace":"workflows","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"f7a11bee77e70ca73a2160e864972d51ef7228d8663bbe3d6737d00144482635","plan_job_ref":"Job Test actions using target and replace #436 at https://github.com/dflook/terraform-github-actions/actions/runs/12447005871","plan_hash":"1d5f7558e672a64e2a0182d004b629e4fbba95e69f45fc2dc16ba60bd67ec53f","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __workflows__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "Eq7j4DgLHp" -> (known after apply)
!~  foreach = "ZphjanrtPA" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #436](https://github.com/dflook/terraform-github-actions/actions/runs/12447005871)